{"name":"COALITION PSI-STALKER","description":"Throughout the Midwest and middle portions of Canada, there are dozens (perhaps hundreds) of tribes of human mutants called Psi-Stalkers. Intimately comfortable in the wild and naturally psionic, they would typically be just another race on the Coalition’s hit list of things to eradicate. However, early encounters happened to be with officers of greater cunning and foresight. So instead, many Psi-Stalkers found themselves with an opportunity to pursue their favorite activities—hunting and slaying supernatural monsters and wielders of magic—while gaining respect, support, and even pay for doing it. Like the Dog Boys, Psi-Stalkers have gained great prominence and a measure of acceptance among front-line CS troops. Their natural gifts in finding and fighting supernatural threats, combined with fearlessness and general expertise in the great wilds most humans avoid, make them exceptionally valuable assets. Unfortunately, their mutant status and generally spooky appearance (pasty white skin, hairless, a tendency to file their teeth into points, prominent tattoos and piercings) make them less than desirable among the Coalition population at large. This suits most of them just fine, as they’d rather be out in the wilderness, hunting, fighting…and feeding. Psi-Stalkers require very little food or water to survive, sustained instead on ISP and PPE energy. Perhaps the greatest reason they were so readily recruited and incorporated into Coalition military and security service, Psi-Stalkers are effectively psychic vampires. Their Psychic Vampire ability enables them to shut down wielders of magic and psionics, which is a handy tactic in any fight against magical forces. For all their feral, apex predator appearance and nature, Psi-Stalkers enjoy an incredible empathy and affinity with most animals. They’re naturally good riders, and most animals treat a Psi-Stalker as one of their own.","attributes":{"Agility":{"name":"Agility","die":8,"mod":0},"Smarts":{"name":"Smarts","die":6,"mod":0},"Spirit":{"name":"Spirit","die":8,"mod":0},"Strength":{"name":"Strength","die":8,"mod":0},"Vigor":{"name":"Vigor","die":8,"mod":0}},"skills":{"Athletics":{"name":"Athletics","die":10,"mod":0},"Common Knowledge":{"name":"Common Knowledge","die":6,"mod":0},"Fighting":{"name":"Fighting","die":10,"mod":0},"Intimidation":{"name":"Intimidation","die":8,"mod":0},"Notice":{"name":"Notice","die":8,"mod":0},"Persuasion":{"name":"Persuasion","die":4,"mod":0},"Riding":{"name":"Riding","die":8,"mod":0},"Shooting":{"name":"Shooting","die":8,"mod":0},"Stealth":{"name":"Stealth","die":8,"mod":0},"Survival":{"name":"Survival","die":8,"mod":0}},"pace":8,"parry":7,"toughness":{"value":17,"armor":7},"hindrances":{"Bloodthirsty":{"name":"Bloodthirsty","major":true,"note":""},"Illiterate":{"name":"Illiterate","major":false,"note":""},"Loyal":{"name":"Loyal","major":false,"note":""},"Mutant":{"name":"Mutant","major":false,"note":""},"Vow":{"name":"Vow","major":false,"note":"Serve the Coalition"}},"edges":["Ambidextrous","Brawny","Two-Fisted","Woodsman"],"gear":{"CA-1 Heavy EBA":{"name":"CA-1 Heavy EBA","description":"+7 Armor, +3 Toughness","quantity":1},"C-12 Heavy Laser Rifle":{"name":"C-12 Heavy Laser Rifle","description":"Range 24/48/96, Damage 4d6, RoF 3, AP 3, Heavy Pulse","quantity":1},"C-18 Laser Pistol":{"name":"C-18 Laser Pistol","description":"Range 12/24/48, Damage 3d6, RoF 1, AP 3","quantity":2},"Vibro-Knive":{"name":"Vibro-Knive","description":"St r +d6 Mega Damage, AP 6","quantity":2},"frag grenade":{"name":"frag grenade","description":"Range 5/10/20, 5d6 Mega Damage, LBT). ","quantity":2}}}