{"name":"lord alistair dunscon","description":"Lord of the City of Brass, ruler of the Kingdom of Dunscon, Alistair Dunscon is the Federation of Magic’s presumptive and virtually undisputed leader. That is to say, many dispute what the Federation is—in terms of land and population—but few deny Dunscon’s rule of it all. In his own mind, all of the Magic Zone must bow to his authority, and ultimately, the world will be his to rule once he is done. His father, Nostrous Dunscon, founded the original Federation, which at one time promised to be a grand alliance of magical powers across the North American continent. Unfortunately, the elder Dunscon’s megalomania, delusions, and ruthlessness led to fractures in an already strained alliance; when the Coalition States came to do battle, he stood without the help of such kingdoms as Tolkeen and the City of Dweomer, and he and his family were slain. Only his young son, Alistair, survived. After years of travel, first as a fugitive through the Magic Zone, and then long journeys through the Rifts, out among the Megaverse®, an eternally youthful Alistair Dunscon returned to the region, claimed his birthright as the rightful ruler of the True Federation of Magic, and began building his kingdom. Far more than ruthless and power-hungry, Alistair embraces evil and rage for all they are worth. He wants to rule, certainly, yet he also craves painful, devastating vengeance against all who abandoned his father, as well as those who directly or indirectly had a hand in the destruction of his family. To this end, he draws the most hate-filled and vengeful survivors of the destruction of Tolkeen to him; he welcomes the most vile practitioners of the darkest of magics; he takes council with greater demons, devil lords, and diabolical supernatural beings— he is even said to be in league with the horrid Splugorth who control Atlantis. In short, Lord Alistair Dunscon is an evil man who seeks to rule a kingdom on the bones and blood of his enemies. Frighteningly, he may have the power to succeed. The Skin of the Demon scale mail armor Dunscon wears is crafted from the body of a living demon (no longer sentient, but still technically alive). Daemonfist is his staff crafted from jade, carved in the form of two intertwined snakes, and the Bands of Denial protect him from enemy evocations.","attributes":{"Agility":{"name":"Agility","die":8,"mod":0},"Smarts":{"name":"Smarts","die":12,"mod":0},"Spirit":{"name":"Spirit","die":12,"mod":0},"Strength":{"name":"Strength","die":6,"mod":0},"Vigor":{"name":"Vigor","die":10,"mod":0}},"skills":{"Athletics":{"name":"Athletics","die":6,"mod":0},"Common Knowledge":{"name":"Common Knowledge","die":6,"mod":0},"Academics":{"name":"Academics","die":10,"mod":0},"Fighting":{"name":"Fighting","die":10,"mod":0},"Healing":{"name":"Healing","die":6,"mod":0},"Intimidation":{"name":"Intimidation","die":12,"mod":0},"Research":{"name":"Research","die":10,"mod":0},"Occult":{"name":"Occult","die":12,"mod":0},"Notice":{"name":"Notice","die":12,"mod":0},"Persuasion":{"name":"Persuasion","die":10,"mod":0},"Shooting":{"name":"Shooting","die":4,"mod":0},"Spellcasting":{"name":"Spellcasting","die":12,"mod":2},"Stealth":{"name":"Stealth","die":8,"mod":0},"Taunt":{"name":"Taunt","die":6,"mod":0}},"pace":6,"parry":7,"toughness":{"value":23,"armor":16},"hindrances":{"Arrogant":{"name":"Arrogant","major":true,"note":""},"Mania":{"name":"Mania","major":true,"note":" Diabolical Megalomania"},"Vengeful":{"name":"Vengeful","major":false,"note":""}},"edges":["Arcane Background (Magic)","Brave","Charismatic","Elan","Filthy Rich","Investigator","Iron Will","Level Headed (Imp)","Ley Line Gate","Ley Line Phasing","Master (Spellcasting)","Master Blaster","Master of Magic","Rapid Recharge","Soul Drain","Wizard"],"gear":{"Skin of the Demon":{"name":"Skin of the Demon","description":"+16 MDC Armor; half damage from heat-based attacks; Environmental Immunity Heat and fire","quantity":1},"Daemonfist":{"name":"Daemonfist","description":"Str+2d6 Mega Damage, +2 Parry, Reach 1, +2 Fighting, +2 Spellcasting, +4 to summon and control demons","quantity":1},"Bands of Denial":{"name":"Bands of Denial","description":"+12 Toughness vs. damaging magical powers and effects). ","quantity":1}},"powers":{"Magic":{"list":["Arcane protection","banish","barrier","beast friend","blast","bolt","boost/lower Trait","burst","conceal arcana","darksight","deflection","disguise","dispel","drain Power Points","entangle","environmental protection","farsight","fear","fly","illusion","intangibility","invisibility","light/ darkness","mind link","protection","puppet","sloth/ speed","slumber","smite","sound/silence","speak language","stun","summon ally","telekinesis","teleport","warrior’s gift"],"pp_name":"PPE","pp_amt":50}},"special_abilities":{"Bind the Summoned":"A Shifter can bind summoned beings to their service for an extended period of time. He does this by reducing his maximum PPE by the amount needed when using summon ally. The creature remains bound to his service until released or Incapacitated. At Legendary Rank, he may retain up to five summoned allies. Bound allies have the Resilient ability. When using Magic Rituals, ignore 4 points of penalties for Improved Duration.","Communication Rift":"By concentrating for a full round Shifters can open microRifts across space and dimensions, just large enough to send and receive spoken messages; costs 15 PPE near a ley line, or 50 PPE away from one.","Dimension Sense":"With a Spellcasting check, determine the following about a dimension","Dimensional Teleport Home":"Once per day for 25 PPE, a Shifter can teleport himself home regardless of distance.","Expanded Awareness":"Shifters detect arcana as an Innate Ability. With a Notice roll, they sense supernatural beings or dimensional manipulations.","Immortality":"Transformed by his travels through the Megaverse®, Dunscon is immortal and immune to most Hazards as well as all possession.","Ley Line Phasing and Ley Line Gate":"See The Tomorrow Legion Player’s Guide.","Ley Line Magic Mastery":"See The Tomorrow Legion Player’s Guide.","Psychotically Brave":"A Legendary Shifter, Dunscon gains +5 to Fear checks and subtracts 5 from Fear Table results.","Regeneration":"Dunscon’s immortality also confers rapid healing—make a Vigor check every hour to heal wounds.","Sense Rifts":"Shifters can sense dimensional anomalies within 50 miles (direction, type, general location), or anywhere along a ley line’s length.","Shift Reality":"Shifters get a free reroll (can't reroll Critical Failures) on all Spellcasting rolls related to","Weakness (Sacrifices)":"The price for Alistair Dunscon's immortality is the sacrificial death of a sentient being once a week, from whom he must drain the life essence at the moment of death"}}